manage/modules/home/services/GroupService.php

    public function getGroupList($is_page = 1)
    {
//        $current_page = Yii::$app->request->get('page', 1);
        $list = Group::find()->where(['is_del' => 0, 'pid' => 0])->orderBy('group_id desc')->asArray()->all();
---
SELECT * FROM `oa_group` WHERE (`is_del`=0) AND (`pid`=0) ORDER BY `group_id` DESC

    private function getSon(&$list)
    {
        if ($list) {
            foreach ($list as &$val) {
                $val['son_list'] = Group::find()->where(['is_del' => 0, 'pid' => $val['group_id']])->orderBy('group_id desc')->asArray()->all();
---
SELECT * FROM `oa_group` WHERE (`is_del`=0) AND (`pid`=56) ORDER BY `group_id` DESC

    private function getSonIds($group_id, &$list=[])
    {
        $tmp_id = Group::find()->select('group_id')->where(['pid' =>$group_id, 'is_del' =>0])->scalar();
---
SELECT `group_id` FROM `oa_group` WHERE `pid`='56'

    public function groupAdd($post)
    {
        $exist = $this->groupNameCheck($post['group_name']);
        if ($exist) {
            return Helper::msg(0, '该部门名称已经被人取了');
        }
        $group_model = new Group();
        $group_model->pid = isset($post['pid']) ? $post['pid'] : 0;
        $group_model->create_user = $_COOKIE['user_id'];
        $group_model->group_name = $post['group_name'];
---
SELECT * FROM `oa_group` WHERE `group_id`='55'

    public function groupEdit($post)
    {
        $model = Group::findOne(['group_id' => $post['group_id']]);
        $before = $model->toArray();
        if (!$model) {
            return Helper::msg(0, '不存在该部门');
        }
        $model->group_name = $post['group_name'];
        if ($post['pid'] != 0) {
            $pid_model = Group::findOne(['group_id' => $post['pid'], 'is_del' => 0]);
            if (!$pid_model) {
                return Helper::msg(0, '上级部门不存在或已删除');
            }
        }
        $exist = $this->groupNameCheck($post['group_name'], $post['group_id']);
        if ($exist) {
            return Helper::msg(0, '该部门名称已经被人取了');
        }
        if (isset($post['pid'])) {
            if ($post['group_id'] === $post['pid']) {
                return Helper::msg(0, '父级部门不能是自己');
            }
            //子部门的id合集
            $son_group_ids = $this->getSonIds($post['group_id']);
            if (in_array($post['pid'], $son_group_ids)) {
                return Helper::msg(0, '父级部门不能是自己的下属部门');
            }
            $model->pid = $post['pid'];
        }
        $model->update_time = time();
        $is_save = $model->save();
---
SELECT * FROM `oa_group` WHERE `group_id`='56'
SELECT * FROM `oa_group` WHERE (`group_id`='60') AND (`is_del`=0)
UPDATE `oa_group` SET `pid`=60, `group_name`='测试部2', `update_time`=1510815637 WHERE `group_id`=56

//        $list[] = $model->attributes;
//        $this->getSon($list);
        if ($is_save) {
            LogService::service()->saveLog($_COOKIE['account'], Log::MODULE_GROUP, $_COOKIE['account'] . '编辑了部门' . $post['group_name'], json_encode($diff));
---
UPDATE `oa_group` SET `pid`=60, `update_time`=1510832398 WHERE `group_id`=56

    private function groupNameCheck($group_name, $group_id = 0)
    {
        $where = !empty($group_id) ? 'group_id != ' . $group_id : '';
        return Group::find()->where(['group_name' => $group_name])->andWhere($where)->exists();
---
SELECT EXISTS(SELECT * FROM `oa_group` WHERE (`group_name`='测试部2') AND (group_id != 56))