manage/modules/home/services/LogService.php

    public function getLogList()
    {
        $current_page = Yii::$app->request->get('page', 1);
        $query = Log::find();
        $total_count = $query->count();
        $page = new Pagination(['totalCount' => $total_count, 'pageSize' => 10]);
        $list = $query
                ->offset($page->offset)
                ->limit($page->limit)
                ->asArray()
                ->all();
---
SELECT * FROM `oa_log`
SELECT COUNT(*) FROM `oa_log`
SELECT * FROM `oa_log` LIMIT 10